package Game;

import java.util.Random;
import java.util.Scanner;

import Util.Util;

public class UpDown {

	public boolean play() {

		Random ran = new Random();
		int ranNum = ran.nextInt(100) + 1;
		Scanner sc = new Scanner(System.in);
		int mLife = 6;

		System.out.print("====1부터 100 사이 UpDownEvent!====");
		System.out.println();
		System.out.print("기회는 6번!");
		System.out.println();
		
		while (mLife > 0) {
			System.out.println();
			System.out.print("1부터 100사이의 정수를 입력하세요 >> ");
			int mTargetNum = sc.nextInt();

			if (mTargetNum < ranNum) {
				

Util.guideLine();
String[] str =
 {
   "⠈⠀⠀⢀⠀⠀⠀⠀⠄⠀⠀⠀⠀⠄⠀⠀⠀⠈⠀⠀⠀⠀⠀⠁⠀⠀⠀⠀⠠⠀⠀⠀⠀⠀⠄⠀⠀⠀⠁",
   "⠀⠀⠀⠀⠀⢀⠀⢀⠀⠐⠀⠀⠀⠀⠐⠀⢠⣴⣶⣄⠁⠀⠀⠀⠐⠀⠀⡀⠀⠀⠂⠀⢀⠀⠀⠐⠀⠀⠀",
   "⠀⠂⠀⠀⠀⢀⠠⠀⠀⠀⠀⠈⢀⠀⢠⣼⣿⣿⣿⣿⣷⣄⠁⠀⠀⠀⠠⠀⠀⠀⠀⠠⠀⠀⠀⠀⠀⠂⠁",
   "⠀⠀⠀⠁⡀⠀⠀⠀⠀⠠⠀⠀⢠⣴⣿⣿⣿⣿⣿⣿⣿⣿⣷⣌⠀⠠⠀⠀⠀⠈⠀⠀⠀⠀⠁⠀⠄⠀⠀",
   "⡀⠄⠀⠁⠀⠀⢀⠀⠀⠀⢠⣼⣿⣿⣿⡿⢻⣿⣿⣿⠻⣿⣿⣿⣷⣄⠀⡀⠀⠁⠈⠀⢀⠠⠀⠁⠀⠀⡀",
   "⠀⠀⠀⠀⠀⠀⠀⠀⣀⣼⣿⣿⣿⡿⠋⠀⢸⣿⣿⣿⠀⠈⠻⣿⣿⣿⣷⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀",
   "⠀⠀⠀⠁⠠⠀⢀⣶⣿⣿⣿⡿⠋⠀⠀⠀⢸⣿⣿⣿⠀⠀⠀⠈⠻⣿⣿⣿⣷⣄⠁⠀⠀⠀⠐⠀⠀⠀⠀",
   "⠈⠀⠀⠀⢀⣴⣿⣿⣿⡿⠋⠀⠀⠀⠀⠀⢸⣿⣿⣿⠀⠀⢀⠀⠀⠈⠻⣿⣿⣿⣷⣄⠐⠈⠀⠀⠈⠀⠈",
   "⠀⠀⠁⠀⢺⣿⣿⡿⠋⠀⠀⠀⠀⠠⠀⠀⢸⣿⣿⣿⠀⠀⠀⠀⢀⠀⠀⠉⠻⣿⣿⣿⠀⠀⠀⠀⠀⠈⠀",
   "⠀⢀⠀⠂⠀⠉⠉⠀⠀⠠⠀⠀⢀⠀⠀⠁⢸⣿⣿⣿⠀⠀⠀⠀⠀⠀⡀⠀⠀⠈⠉⠀⠀⠀⠀⠁⠀⠀⢀",
   "⠀⡀⠀⠀⠀⠀⠄⠂⠀⠀⠀⠈⠀⠀⠀⠀⢸⣿⣿⣿⠀⠀⡈⠀⠀⠀⢀⠀⠁⠀⠀⠀⠂⢀⠀⠀⠀⠁⢀",
   "⠀⠀⠀⠠⠐⠀⠀⠀⠀⠠⠀⠀⠀⠄⠐⠀⢸⣿⣿⣿⠀⠀⠀⠀⠐⠀⠀⠀⠀⠄⠂⠀⠀⠀⠀⠐⠀⠀⠀",
   "⠀⡀⠀⠀⠀⠀⠀⡀⠀⠀⠀⠄⠀⠀⠀⠀⢸⣿⣿⣿⠀⠀⢀⠀⠀⠀⠄⠀⡀⠀⠀⢀⠠⠀⠈⠀⠀⠠⠀",
   "⠀⠀⠄⠀⠀⠀⠁⠀⠀⠀⠠⠀⠂⠀⠀⠐⢸⣿⣿⣿⠀⠀⠀⠀⠀⠀⠠⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠄⠂",
   "⠀⠀⠀⠠⠈⠀⠀⠀⠀⠁⠀⠀⠀⠀⠈⠀⢸⣿⣿⣿⠀⠀⠀⠈⠀⠁⠀⠀⠀⠐⠈⠀⠀⠀⠈⢀⠀⠀⠀",
   "⠠⠀⠀⠀⠀⠀⠄⠂⠀⠀⠐⠀⠠⠀⠀⠐⢸⣿⣿⣿⠀⠀⠄⠂⠀⠀⠠⠀⠂⠀⠀⠀⠄⠐⠀⠀⠀⠀⠄",
   "⠀⠀⠁⠀⡀⠀⠀⠀⢀⠠⠀⠀⠀⢀⠀⠀⢸⣿⣿⣿⠀⠀⠀⠀⠀⡀⠀⠀⠀⢀⠀⠀⠀⠀⢀⠀⠀⠀⠀",
   "⡀⠀⠀⠀⠀⢀⠀⢀⠀⠀⠀⠀⢀⠀⠀⠂⠸⣿⣿⡿⠀⠀⠀⠀⠁⠀⠀⠀⠀⠀⠀⡀⢀⠀⠀⠀⠄⠀⡀",
   "⠀⠀⠁⠀⠀ ⠀⠀⠀⠀⠁⠀⠀⠀⠀⢀⠈⠀⠀⠀⠀⠂⠁⠀⠀⢀⠈⠀⠀⠀⠀⡀⠀⠀⠀⠀⠄⠀",
};
String[] value = Util.setMiddle(str);

System.out.println();		

Util.print(value);

Util.guideLine();
System.out.print("더 큰 수로 다시 시도하세요 ~!! ");
System.out.println();
mLife--;
System.out.print("남은 목숨 : " + mLife + "개");
System.out.println();
if(mLife==0) {
	System.out.print("Game Over !" +"  ");
	System.out.println("정답은" + ranNum + "입니다.");
}

			} else if (mTargetNum > ranNum) {
				
Util.guideLine();
String[] str =
{
"⠠⠀⠂⠀⠐⠀⠀⠂⠀⠂⠀⠂⠀⠂⠀⠂⠀⠂⠀⠂⡀⠂⠀⠂⠀⠂⠀⠂⠀⠂⠀⠂⠀⠂⠀⠂⠀⠂⠀⠂⠀",
"⠀⠀⠠⠐⠀⠀⠁⠀⠄⠀⠂⠀⠄⠂⠀⠠⠐⠀⣴⣿⣿⣿⣆⠀⠄⠀⠂⠀⠄⠂⠀⠄⠐⠀⢀⠐⠀⠠⠐⠀⠐",
"⠀⠈⠀⠀⠀⠄⠁⠀⡀⠄⠀⠄⠀⠀⠄⠀⠀⠄⣿⣿⣿⣿⣿⠀⠀⠄⠀⠄⠀⢀⠀⠠⠀⠀⠀⡀⠀⠄⠀⠀⠠",
"⠀⠀⠂⠈⠀⠀⡀⠄⠀⠀⢀⠀⠐⠀⠀⠐⠀⢈⣿⣿⣿⣿⣿⠀⠐⠀⠀⡀⠄⠀⢀⠀⢀⠈⠀⠀⠀⡀⢀⠈⠀",
"⠂⠁⠀⠀⠂⠁⠀⠀⠀⠐⠀⠀⠠⠀⠁⠀⠠⠀⣿⣿⣿⣿⣿⠀⠂⠀⠁⠀⠀⢀⠀⠀⡀⠀⠠⠈⠀⠀⠀⠀⠀",
"⢀⠀⠂⠁⠀⢀⠠⠐⠀⠂⠀⠐⠀⠀⠐⠈⠀⠈⣿⣿⣿⣿⣿⠀⠄⠂⠀⠐⠀⠀⢀⠀⠀⠠⠀⠀⠄⠂⠀⠈⠀",
"⠀⠀⡀⠠⠀⠀⠀⠀⠀⠀⠄⠂⠀⠁⠀⡀⠀⢈⣿⣿⣿⣿⣿⠀⢀⠀⠄⠂⠀⠁⠀⠀⠐⠀⠀⠠⠀⠀⠄⠈⠀",
"⠈⠀⠀⠀⡀⠈⠀⠀⠁⢀⠀⠀⡀⠂⠀⠀⠠⠀⣿⣿⣿⣿⣿⠀⠄⠀⠀⠀⠀⠂⠀⠂⠀⠂⠀⠄⠀⠂⠀⠀⠐",
"⠀⠠⠐⠀⠀⠀⠈⡀⡈⠀⠀⢀⠀⠀⠠⠈⠀⠈⣿⣿⣿⣿⣿⠀⢀⠠⠐⠈⠀⠀⠄⠂⢀⣐⠀⠀⠠⠐⠀⠈⠀",
"⠁⠀⠀⡀⠐⢨⣾⣿⣿⣶⣄⠀⠀⠈⠀⠀⡀⢈⣿⣿⣿⣿⣿⠀⡀⠀⠀⠀⡀⠄⣠⣾⣿⣿⣿⣆⠀⢀⠀⠐⠀",
"⠄⠂⠁⠀⠀⢹⣿⣿⣿⣿⣿⣧⣄⠁⠀⢀⠀⠠⣿⣿⣿⣿⣿⠀⢀⠀⠂⠀⣠⣾⣿⣿⣿⣿⣿⡟⠀⠀⠀⠀⠄",
"⠀⠀⠀⡀⠠⠀⠙⢿⣿⣿⣿⣿⣿⣶⡄⠀⠀⠐⣿⣿⣿⣿⣿⠀⡀⠀⣠⣾⣿⣿⣿⣿⣿⡿⠋⠀⠀⢀⠈⠀⠀",
"⠀⠁⠀⠀⠀⡀⠠⠀⠙⢿⣿⣿⣿⣿⣿⣧⡄⢁⣿⣿⣿⣿⣿⠀⣠⣾⣿⣿⣿⣿⣿⡿⠋⠀⠀⠀⡀⠀⡀⠐⠈",
"⡀⠀⠐⠀⠁⠀⠀⠀⠠⠈⠙⣿⣿⣿⣿⣿⣿⣶⣿⣿⣿⣿⣿⣾⣿⣿⣿⣿⣿⡿⠋⠀⠀⢀⠠⠀⠀⢀⠀⠀⡀",
"⠀⠀⠂⠀⠄⠀⠂⠁⠀⠀⡀⠀⠹⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠋⠀⢀⠀⠐⠀⠀⢀⠠⠀⠀⢀⠀",
"⠀⠂⠀⠠⠀⠀⠄⠠⠀⠁⠀⠀⡀⠈⠹⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠋⠀⡀⠄⠀⠀⠠⠀⠄⠀⠀⠀⠄⠀⢀",
"⠀⠀⠂⠀⠄⠂⠀⢀⠀⠠⠐⠀⠀⢀⠀⠈⠹⢿⣿⣿⣿⣿⣿⡿⠏⠀⠂⠀⠀⠀⡀⠈⠀⠀⠀⠐⠀⠂⠀⠐⠀",
"⠀⠂⠀⠠⠀⠀⡀⠀⢀⠀⠀⡀⠠⠀⠀⡀⠂⠈⠛⣿⣿⡿⠏⠁⠀⠀⠄⠂⠈⠀⠀⠀⠐⠈⠀⠠⠀⠀⠄⠂⠀",
"⠐⠀⠈⠀⠀⡀⠀⡀⠄⠀⢀⠀⠀⢀⠀⠀⠀⡀⠀⠀⠀⠀⠀⠀⠄⠂⠀⠀⡀⠀⠂⠁⠀⠠⠀⠀⠄⠂⠀⠀⠠",
"⠀⠀⠐⠀⢀⠀⠀⠀⠀⢀⠀⠀⠈⠀⠀⠈⠀⠀⠀⠈⠀⠐⠈⠀⠀⠀⠠⠀⠀⡀⠄⠀⠂⠀⠠⠀⠀⡀⠠⠈⠀"
};		
String[] value = Util.setMiddle(str);
Util.print(value);
Util.guideLine();

System.out.print("더 작은 수로 다시 시도하세요 ~!!");
System.out.println();
mLife--;
System.out.print("남은 목숨 : " + mLife + "개");
System.out.println();
 if(mLife==0) {
	 System.out.print("Game Over !"+"  ");
	 System.out.println("정답은" + ranNum + "입니다.");
 }
				 
			} else {
				System.out.print(ranNum + " 정답입니다~!!");
				System.out.println();
				System.out.print("Game Success");
				System.out.println();
				break;
			}
		}

		return false;

	
	
	
	
	
	}
}
